const sampleData = JSON.parse(`{
    "subDepartments": {
      "Центральный офис": {
        "name": "Центральный офис",
        "subDepartments": {
          "Корпоративный блок": {
            "name": "Корпоративный блок",
            "subDepartments": {
              "онлайн-банкинг для бизнеса": {
                "name": "онлайн-банкинг для бизнеса",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 3,
                    "name": "Альберт",
                    "surname": "Кузнецов",
                    "flag": "На больничном",
                    "position": "Владелец продукта"
                  },
                  {
                    "id": 4,
                    "name": "Александр",
                    "surname": "Соколов",
                    "flag": "Свободен",
                    "position": "UX/UI Дизайнер"
                  },
                  {
                    "id": 5,
                    "name": "Алексей",
                    "surname": "Попов",
                    "flag": "Свободен",
                    "position": "UX Дизайнер"
                  },
                  {
                    "id": 6,
                    "name": "Альберт",
                    "surname": "Лебедев",
                    "flag": "Свободен",
                    "position": "Системный аналитик"
                  },
                  {
                    "id": 7,
                    "name": "Алексей",
                    "surname": "Козлов",
                    "flag": "В отупске",
                    "position": "Бизнес аналитик"
                  },
                  {
                    "id": 8,
                    "name": "Альберт",
                    "surname": "Новиков",
                    "flag": "На больничном",
                    "position": "Ведущий backend  разработчик"
                  },
                  {
                    "id": 9,
                    "name": "Анатолий",
                    "surname": "Морозов",
                    "flag": "Свободен",
                    "position": "Старший backend  разработчик"
                  },
                  {
                    "id": 10,
                    "name": "Андрей",
                    "surname": "Петров",
                    "flag": "Свободен",
                    "position": "backend разработчик"
                  },
                  {
                    "id": 11,
                    "name": "Аникий",
                    "surname": "Волков",
                    "flag": "Свободен",
                    "position": "Ведущий frontend  разработчик"
                  },
                  {
                    "id": 12,
                    "name": "Аникита",
                    "surname": "Соловьёв",
                    "flag": "В отупске",
                    "position": "Старший frontend  разработчик"
                  },
                  {
                    "id": 13,
                    "name": "Антон",
                    "surname": "Васильев",
                    "flag": "На больничном",
                    "position": "frontend разработчик"
                  },
                  {
                    "id": 14,
                    "name": "Антонин",
                    "surname": "Зайцев",
                    "flag": "Свободен",
                    "position": "Тестировщик"
                  },
                  {
                    "id": 15,
                    "name": "Анфим",
                    "surname": "Павлов",
                    "flag": "Свободен",
                    "position": "Старший тестировщик"
                  }
                ]
              },
              "транзакционные продукты": {
                "name": "транзакционные продукты",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 16,
                    "name": "Александр",
                    "surname": "Семёнов",
                    "flag": "Свободен",
                    "position": "Владелец продукта"
                  },
                  {
                    "id": 17,
                    "name": "Алексей",
                    "surname": "Голубев",
                    "flag": "В отупске",
                    "position": "UX/UI Дизайнер"
                  },
                  {
                    "id": 18,
                    "name": "Альберт",
                    "surname": "Виноградов",
                    "flag": "На больничном",
                    "position": "Бизнес аналитик"
                  },
                  {
                    "id": 19,
                    "name": "Вавила",
                    "surname": "Богданов",
                    "flag": "Свободен",
                    "position": "Ведущий backend  разработчик"
                  },
                  {
                    "id": 20,
                    "name": "Вадим",
                    "surname": "Воробьёв",
                    "flag": "Свободен",
                    "position": "Старший backend  разработчик"
                  },
                  {
                    "id": 21,
                    "name": "Валентин",
                    "surname": "Фёдоров",
                    "flag": "Свободен",
                    "position": "Ведущий frontend  разработчик"
                  },
                  {
                    "id": 22,
                    "name": "Валерий",
                    "surname": "Михайлов",
                    "flag": "В отупске",
                    "position": "Старший frontend  разработчик"
                  },
                  {
                    "id": 23,
                    "name": "Валерьян",
                    "surname": "Беляев",
                    "flag": "На больничном",
                    "position": "frontend разработчик"
                  },
                  {
                    "id": 24,
                    "name": "Варлам",
                    "surname": "Тарасов",
                    "flag": "Свободен",
                    "position": "Тестировщик"
                  },
                  {
                    "id": 25,
                    "name": "Гавриил",
                    "surname": "Белов",
                    "flag": "Свободен",
                    "position": "Старший тестировщик"
                  }
                ]
              },
              "Управление по работе с филиалами": {
                "name": "Управление по работе с филиалами",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 26,
                    "name": "Александр",
                    "surname": "Комаров",
                    "flag": "Свободен",
                    "position": "Директор управления"
                  },
                  {
                    "id": 27,
                    "name": "Алексей",
                    "surname": "Орлов",
                    "flag": "В отупске",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 28,
                    "name": "Альберт",
                    "surname": "Киселёв",
                    "flag": "На больничном",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 29,
                    "name": "Георгий",
                    "surname": "Макаров",
                    "flag": "Свободен",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 30,
                    "name": "Акулина",
                    "surname": "Андреева",
                    "flag": "Свободен",
                    "position": "Аналитик"
                  },
                  {
                    "id": 31,
                    "name": "Алевтина",
                    "surname": "Ковалёва",
                    "flag": "Свободен",
                    "position": "Старший аналитик"
                  }
                ]
              }
            },
            "workers": [
              {
                "id": 2,
                "name": "Алексей",
                "surname": "Иванов",
                "flag": "В отупске",
                "position": "Заместитель председателя банка"
              }
            ]
          },
          "Розничный блок": {
            "name": "Розничный блок",
            "subDepartments": {
              "онлайн-банкинг": {
                "name": "онлайн-банкинг",
                "subDepartments": {
                  "команда 1": {
                    "name": "команда 1",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 34,
                        "name": "Алла",
                        "surname": "Титова",
                        "flag": "Свободен",
                        "position": "Team leader"
                      },
                      {
                        "id": 35,
                        "name": "Анастасия",
                        "surname": "Кузьмина",
                        "flag": "Свободен",
                        "position": "UX/UI Дизайнер"
                      },
                      {
                        "id": 36,
                        "name": "Ангелина",
                        "surname": "Кудрявцева",
                        "flag": "Свободен",
                        "position": "UX Дизайнер"
                      },
                      {
                        "id": 37,
                        "name": "Анжела",
                        "surname": "Баранова",
                        "flag": "В отупске",
                        "position": "Системный аналитик"
                      },
                      {
                        "id": 38,
                        "name": "Евгения",
                        "surname": "Куликова",
                        "flag": "На больничном",
                        "position": "Бизнес аналитик"
                      },
                      {
                        "id": 39,
                        "name": "Евдокия",
                        "surname": "Алексеева",
                        "flag": "Свободен",
                        "position": "Ведущий backend  разработчик"
                      },
                      {
                        "id": 40,
                        "name": "Екатерина",
                        "surname": "Степанова",
                        "flag": "Свободен",
                        "position": "Старший backend  разработчик"
                      },
                      {
                        "id": 41,
                        "name": "Елена",
                        "surname": "Яковлева",
                        "flag": "Свободен",
                        "position": "backend разработчик"
                      },
                      {
                        "id": 42,
                        "name": "Елизавета",
                        "surname": "Сорокина",
                        "flag": "В отупске",
                        "position": "Ведущий frontend  разработчик"
                      },
                      {
                        "id": 43,
                        "name": "Маргарита",
                        "surname": "Сергеева",
                        "flag": "На больничном",
                        "position": "Старший frontend  разработчик"
                      },
                      {
                        "id": 44,
                        "name": "Марина",
                        "surname": "Романова",
                        "flag": "Свободен",
                        "position": "frontend разработчик"
                      },
                      {
                        "id": 45,
                        "name": "Валентина",
                        "surname": "Захарова",
                        "flag": "Свободен",
                        "position": "Тестировщик"
                      }
                    ]
                  },
                  "команда 2": {
                    "name": "команда 2",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 46,
                        "name": "Валерия",
                        "surname": "Борисова",
                        "flag": "Свободен",
                        "position": "Team leader"
                      },
                      {
                        "id": 47,
                        "name": "Варвара",
                        "surname": "Королёва",
                        "flag": "В отупске",
                        "position": "UX Дизайнер"
                      },
                      {
                        "id": 48,
                        "name": "Василиса",
                        "surname": "Герасимова",
                        "flag": "На больничном",
                        "position": "UI Дизайнер"
                      },
                      {
                        "id": 49,
                        "name": "Зинаида",
                        "surname": "Пономарёва",
                        "flag": "Свободен",
                        "position": "UX Дизайнер"
                      },
                      {
                        "id": 50,
                        "name": "Злата",
                        "surname": "Григорьева",
                        "flag": "Свободен",
                        "position": "Системный аналитик"
                      },
                      {
                        "id": 51,
                        "name": "Евгения",
                        "surname": "Лазарева",
                        "flag": "Свободен",
                        "position": "Бизнес аналитик"
                      },
                      {
                        "id": 52,
                        "name": "Евдокия",
                        "surname": "Медведева",
                        "flag": "В отупске",
                        "position": "Ведущий backend  разработчик"
                      },
                      {
                        "id": 53,
                        "name": "Екатерина",
                        "surname": "Ершова",
                        "flag": "На больничном",
                        "position": "Старший backend  разработчик"
                      },
                      {
                        "id": 54,
                        "name": "Елена",
                        "surname": "Никитина",
                        "flag": "Свободен",
                        "position": "backend разработчик"
                      },
                      {
                        "id": 55,
                        "name": "Елизавета",
                        "surname": "Соболева",
                        "flag": "Свободен",
                        "position": "Ведущий frontend  разработчик"
                      },
                      {
                        "id": 56,
                        "name": "Маргарита",
                        "surname": "Рябова",
                        "flag": "Свободен",
                        "position": "Старший frontend  разработчик"
                      },
                      {
                        "id": 57,
                        "name": "Марина",
                        "surname": "Полякова",
                        "flag": "В отупске",
                        "position": "frontend разработчик"
                      },
                      {
                        "id": 58,
                        "name": "Валентина",
                        "surname": "Цветкова",
                        "flag": "На больничном",
                        "position": "Тестировщик"
                      },
                      {
                        "id": 59,
                        "name": "Валерия",
                        "surname": "Данилова",
                        "flag": "Свободен",
                        "position": "Тестировщик"
                      }
                    ]
                  }
                },
                "workers": [
                  {
                    "id": 33,
                    "name": "Алина",
                    "surname": "Гусева",
                    "flag": "На больничном",
                    "position": "Владелец продукта"
                  }
                ]
              },
              "Управление по работе с филиалами": {
                "name": "Управление по работе с филиалами",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 60,
                    "name": "Варвара",
                    "surname": "Жукова",
                    "flag": "Свободен",
                    "position": "Директор управления"
                  },
                  {
                    "id": 61,
                    "name": "Василиса",
                    "surname": "Фролова",
                    "flag": "Свободен",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 62,
                    "name": "Акулина",
                    "surname": "Журавлёва",
                    "flag": "В отупске",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 63,
                    "name": "Алевтина",
                    "surname": "Николаева",
                    "flag": "На больничном",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 64,
                    "name": "Александра",
                    "surname": "Крылова",
                    "flag": "Свободен",
                    "position": "Аналитик"
                  },
                  {
                    "id": 65,
                    "name": "Алина",
                    "surname": "Максимова",
                    "flag": "Свободен",
                    "position": "Старший аналитик"
                  },
                  {
                    "id": 66,
                    "name": "Алла",
                    "surname": "Сидорова",
                    "flag": "Свободен",
                    "position": "Ведущий аналитик"
                  }
                ]
              }
            },
            "workers": [
              {
                "id": 32,
                "name": "Александра",
                "surname": "Ильина",
                "flag": "В отупске",
                "position": "Заместитель председателя банка"
              }
            ]
          }
        },
        "workers": [
          {
            "id": 1,
            "name": "Александр",
            "surname": "Смирнов",
            "flag": "Свободен",
            "position": "Председатель банка"
          }
        ]
      },
      "Филиал в Оренбургской области": {
        "name": "Филиал в Оренбургской области",
        "subDepartments": {
          "Корпоративный блок": {
            "name": "Корпоративный блок",
            "subDepartments": {
              "Управление по работе с клиентами крупного и среднего бизнеса": {
                "name": "Управление по работе с клиентами крупного и среднего бизнеса",
                "subDepartments": {
                  "Отдел кредитования": {
                    "name": "Отдел кредитования",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 70,
                        "name": "Оксана",
                        "surname": "Дорофеева",
                        "flag": "Свободен",
                        "position": "Начальник отдела"
                      },
                      {
                        "id": 71,
                        "name": "Октябрина",
                        "surname": "Егорова",
                        "flag": "Свободен",
                        "position": "Кредитный инспектор"
                      },
                      {
                        "id": 72,
                        "name": "Ольга",
                        "surname": "Матвеева",
                        "flag": "В отупске",
                        "position": "Кредитный аналитик"
                      },
                      {
                        "id": 73,
                        "name": "Александра",
                        "surname": "Боброва",
                        "flag": "На больничном",
                        "position": "Кредитный аналитик"
                      }
                    ]
                  },
                  "Отдел продаж 1": {
                    "name": "Отдел продаж 1",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 74,
                        "name": "Алина",
                        "surname": "Дмитриева",
                        "flag": "Свободен",
                        "position": "Начальник отдела"
                      },
                      {
                        "id": 75,
                        "name": "Алла",
                        "surname": "Калинина",
                        "flag": "Свободен",
                        "position": "Главный клиенсткий менеджер"
                      },
                      {
                        "id": 76,
                        "name": "Анжела",
                        "surname": "Анисимова",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 77,
                        "name": "Евгения",
                        "surname": "Петухова",
                        "flag": "В отупске",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 78,
                        "name": "Анжела",
                        "surname": "Антонова",
                        "flag": "На больничном",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 79,
                        "name": "Евгения",
                        "surname": "Тимофеева",
                        "flag": "Свободен",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 80,
                        "name": "Елена",
                        "surname": "Никифорова",
                        "flag": "Свободен",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 81,
                        "name": "Елизавета",
                        "surname": "Веселова",
                        "flag": "Свободен",
                        "position": "Ассистент клиентского менеджера"
                      }
                    ]
                  },
                  "Отдел продаж 2": {
                    "name": "Отдел продаж 2",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 82,
                        "name": "Александр",
                        "surname": "Филиппов",
                        "flag": "В отупске",
                        "position": "Начальник отдела"
                      },
                      {
                        "id": 83,
                        "name": "Алексей",
                        "surname": "Марков",
                        "flag": "На больничном",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 84,
                        "name": "Альберт",
                        "surname": "Большаков",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 85,
                        "name": "Александр",
                        "surname": "Суханов",
                        "flag": "Свободен",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 86,
                        "name": "Алексей",
                        "surname": "Миронов",
                        "flag": "Свободен",
                        "position": "Старший клиенсткий менеджер"
                      }
                    ]
                  }
                },
                "workers": [
                  {
                    "id": 69,
                    "name": "Анжела",
                    "surname": "Федотова",
                    "flag": "Свободен",
                    "position": "Начальник управления"
                  }
                ]
              },
              "Управление по работе с клиентами малого бизнеса": {
                "name": "Управление по работе с клиентами малого бизнеса",
                "subDepartments": {
                  "Отдел 1": {
                    "name": "Отдел 1",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 88,
                        "name": "Оксана",
                        "surname": "Ершова",
                        "flag": "На больничном",
                        "position": "Начальник отдела"
                      },
                      {
                        "id": 89,
                        "name": "Алексей",
                        "surname": "Александров",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 90,
                        "name": "Альберт",
                        "surname": "Коновалов",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 91,
                        "name": "Анатолий",
                        "surname": "Шестаков",
                        "flag": "Свободен",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 92,
                        "name": "Андрей",
                        "surname": "Казаков",
                        "flag": "В отупске",
                        "position": "Старший клиенсткий менеджер"
                      }
                    ]
                  },
                  "Отдел 2": {
                    "name": "Отдел 2",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 93,
                        "name": "Вадим",
                        "surname": "Савельев",
                        "flag": "На больничном",
                        "position": "Начальник отдела"
                      },
                      {
                        "id": 94,
                        "name": "Аникий",
                        "surname": "Ефимов",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 95,
                        "name": "Аникита",
                        "surname": "Денисов",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 96,
                        "name": "Антон",
                        "surname": "Громов",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 97,
                        "name": "Антонин",
                        "surname": "Фомин",
                        "flag": "В отупске",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 98,
                        "name": "Анфим",
                        "surname": "Давыдов",
                        "flag": "На больничном",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 99,
                        "name": "Александр",
                        "surname": "Мельников",
                        "flag": "Свободен",
                        "position": "Старший клиенсткий менеджер"
                      }
                    ]
                  },
                  "Отдел кредитования": {
                    "name": "Отдел кредитования",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 100,
                        "name": "Алексей",
                        "surname": "Щербаков",
                        "flag": "Свободен",
                        "position": "Начальник отдела"
                      },
                      {
                        "id": 101,
                        "name": "Альберт",
                        "surname": "Блинов",
                        "flag": "Свободен",
                        "position": "Кредитный аналитик"
                      },
                      {
                        "id": 102,
                        "name": "Вавила",
                        "surname": "Колесников",
                        "flag": "В отупске",
                        "position": "Кредитный аналитик"
                      },
                      {
                        "id": 103,
                        "name": "Вадим",
                        "surname": "Карпов",
                        "flag": "На больничном",
                        "position": "Кредитный аналитик"
                      }
                    ]
                  }
                },
                "workers": [
                  {
                    "id": 87,
                    "name": "Альберт",
                    "surname": "Ширяев",
                    "flag": "В отупске",
                    "position": "Начальник управления"
                  }
                ]
              }
            },
            "workers": [
              {
                "id": 68,
                "name": "Ангелина",
                "surname": "Белоусова",
                "flag": "На больничном",
                "position": "Заместитель управляющего филиалом"
              }
            ]
          },
          "Розничный блок": {
            "name": "Розничный блок",
            "subDepartments": {
              "Управление ипотечного кредитования": {
                "name": "Управление ипотечного кредитования",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 105,
                    "name": "Валерий",
                    "surname": "Власов",
                    "flag": "Свободен",
                    "position": "Начальник управления"
                  },
                  {
                    "id": 106,
                    "name": "Валерьян",
                    "surname": "Маслов",
                    "flag": "Свободен",
                    "position": "Менеджер по работе с партнерами"
                  },
                  {
                    "id": 107,
                    "name": "Варлам",
                    "surname": "Исаков",
                    "flag": "В отупске",
                    "position": "Менеджер по работе с партнерами"
                  },
                  {
                    "id": 108,
                    "name": "Гавриил",
                    "surname": "Тихонов",
                    "flag": "На больничном",
                    "position": "Менеджер по работе с партнерами"
                  },
                  {
                    "id": 109,
                    "name": "Вавила",
                    "surname": "Аксёнов",
                    "flag": "Свободен",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 110,
                    "name": "Вадим",
                    "surname": "Гаврилов",
                    "flag": "Свободен",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 111,
                    "name": "Валентин",
                    "surname": "Родионов",
                    "flag": "Свободен",
                    "position": "Территориальный менеджер"
                  }
                ]
              },
              "Управление инвестиционных продуктов": {
                "name": "Управление инвестиционных продуктов",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 112,
                    "name": "Валерий",
                    "surname": "Котов",
                    "flag": "В отупске",
                    "position": "Начальник управления"
                  },
                  {
                    "id": 113,
                    "name": "Валерьян",
                    "surname": "Горбунов",
                    "flag": "На больничном",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 114,
                    "name": "Варлам",
                    "surname": "Кудряшов",
                    "flag": "Свободен",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 115,
                    "name": "Гавриил",
                    "surname": "Быков",
                    "flag": "Свободен",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 116,
                    "name": "Александр",
                    "surname": "Зуев",
                    "flag": "Свободен",
                    "position": "Тренер по продуктам"
                  },
                  {
                    "id": 117,
                    "name": "Алексей",
                    "surname": "Третьяков",
                    "flag": "В отупске",
                    "position": "Тренер по продуктам"
                  }
                ]
              },
              "Дополнительный офис 1": {
                "name": "Дополнительный офис 1",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 118,
                    "name": "Альберт",
                    "surname": "Савельев",
                    "flag": "На больничном",
                    "position": "Руководитель офиса"
                  },
                  {
                    "id": 119,
                    "name": "Георгий",
                    "surname": "Панов",
                    "flag": "Свободен",
                    "position": "Менеджер по ипотеке"
                  },
                  {
                    "id": 120,
                    "name": "Вавила",
                    "surname": "Рыбаков",
                    "flag": "Свободен",
                    "position": "Менеджер по продажам"
                  },
                  {
                    "id": 121,
                    "name": "Вадим",
                    "surname": "Суворов",
                    "flag": "Свободен",
                    "position": "Ведущий менеджер по продажам"
                  },
                  {
                    "id": 122,
                    "name": "Валентин",
                    "surname": "Абрамов",
                    "flag": "В отупске",
                    "position": "Клиентский менеджер"
                  },
                  {
                    "id": 123,
                    "name": "Валерий",
                    "surname": "Воронов",
                    "flag": "На больничном",
                    "position": "Кассир"
                  },
                  {
                    "id": 124,
                    "name": "Валерьян",
                    "surname": "Мухин",
                    "flag": "Свободен",
                    "position": "Старший кассир"
                  }
                ]
              },
              "Дополнительный офис 2": {
                "name": "Дополнительный офис 2",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 125,
                    "name": "Варлам",
                    "surname": "Архипов",
                    "flag": "Свободен",
                    "position": "Руководитель офиса"
                  },
                  {
                    "id": 126,
                    "name": "Гавриил",
                    "surname": "Трофимов",
                    "flag": "Свободен",
                    "position": "Менеджер по продажам"
                  },
                  {
                    "id": 127,
                    "name": "Александр",
                    "surname": "Мартынов",
                    "flag": "В отупске",
                    "position": "Ведущий менеджер по продажам"
                  },
                  {
                    "id": 128,
                    "name": "Алексей",
                    "surname": "Емельянов",
                    "flag": "На больничном",
                    "position": "Клиентский менеджер"
                  },
                  {
                    "id": 129,
                    "name": "Альберт",
                    "surname": "Горшков",
                    "flag": "Свободен",
                    "position": "Кассир"
                  },
                  {
                    "id": 130,
                    "name": "Георгий",
                    "surname": "Чернов",
                    "flag": "Свободен",
                    "position": "Старший кассир"
                  }
                ]
              },
              "Дополнительный офис 3": {
                "name": "Дополнительный офис 3",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 131,
                    "name": "Вавила",
                    "surname": "Овчинников",
                    "flag": "Свободен",
                    "position": "Руководитель офиса"
                  },
                  {
                    "id": 132,
                    "name": "Вадим",
                    "surname": "Селезнёв",
                    "flag": "В отупске",
                    "position": "Менеджер по ипотеке"
                  },
                  {
                    "id": 133,
                    "name": "Валентин",
                    "surname": "Панфилов",
                    "flag": "На больничном",
                    "position": "Менеджер по продажам"
                  },
                  {
                    "id": 134,
                    "name": "Валерий",
                    "surname": "Копылов",
                    "flag": "Свободен",
                    "position": "Ведущий менеджер по продажам"
                  },
                  {
                    "id": 135,
                    "name": "Валерьян",
                    "surname": "Михеев",
                    "flag": "Свободен",
                    "position": "Клиентский менеджер"
                  },
                  {
                    "id": 136,
                    "name": "Варлам",
                    "surname": "Галкин",
                    "flag": "Свободен",
                    "position": "Кассир"
                  },
                  {
                    "id": 137,
                    "name": "Гавриил",
                    "surname": "Назаров",
                    "flag": "В отупске",
                    "position": "Старший кассир"
                  }
                ]
              },
              "Дополнительный офис 4": {
                "name": "Дополнительный офис 4",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 138,
                    "name": "Александр",
                    "surname": "Лобанов",
                    "flag": "На больничном",
                    "position": "Руководитель офиса"
                  },
                  {
                    "id": 139,
                    "name": "Алексей",
                    "surname": "Лукин",
                    "flag": "Свободен",
                    "position": "Менеджер по продажам"
                  },
                  {
                    "id": 140,
                    "name": "Альберт",
                    "surname": "Беляков",
                    "flag": "Свободен",
                    "position": "Ведущий менеджер по продажам"
                  },
                  {
                    "id": 141,
                    "name": "Георгий",
                    "surname": "Потапов",
                    "flag": "Свободен",
                    "position": "Клиентский менеджер"
                  },
                  {
                    "id": 142,
                    "name": "Вавила",
                    "surname": "Некрасов",
                    "flag": "В отупске",
                    "position": "Кассир"
                  },
                  {
                    "id": 143,
                    "name": "Вадим",
                    "surname": "Хохлов",
                    "flag": "На больничном",
                    "position": "Старший кассир"
                  }
                ]
              }
            },
            "workers": [
              {
                "id": 104,
                "name": "Валентин",
                "surname": "Афанасьев",
                "flag": "Свободен",
                "position": "Заместитель управляющего филиалом"
              }
            ]
          }
        },
        "workers": [
          {
            "id": 67,
            "name": "Анастасия",
            "surname": "Осипова",
            "flag": "В отупске",
            "position": "Управляющий филиала"
          }
        ]
      },
      "Филиал в Волгоградской области": {
        "name": "Филиал в Волгоградской области",
        "subDepartments": {
          "Корпоративный блок": {
            "name": "Корпоративный блок",
            "subDepartments": {
              "Управление по работе с клиентами крупного и среднего бизнеса": {
                "name": "Управление по работе с клиентами крупного и среднего бизнеса",
                "subDepartments": {
                  "Отдел кредитования": {
                    "name": "Отдел кредитования",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 147,
                        "name": "Варлам",
                        "surname": "Воронцов",
                        "flag": "В отупске",
                        "position": "Начальник отдела"
                      },
                      {
                        "id": 148,
                        "name": "Зинаида",
                        "surname": "Ермакова",
                        "flag": "На больничном",
                        "position": "Кредитный инспектор"
                      },
                      {
                        "id": 149,
                        "name": "Злата",
                        "surname": "Дроздова",
                        "flag": "Свободен",
                        "position": "Кредитный аналитик"
                      },
                      {
                        "id": 150,
                        "name": "Евгения",
                        "surname": "Игнатьева",
                        "flag": "Свободен",
                        "position": "Кредитный аналитик"
                      }
                    ]
                  },
                  "Отдел продаж 1": {
                    "name": "Отдел продаж 1",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 151,
                        "name": "Евдокия",
                        "surname": "Савина",
                        "flag": "Свободен",
                        "position": "Начальник отдела"
                      },
                      {
                        "id": 152,
                        "name": "Екатерина",
                        "surname": "Логинова",
                        "flag": "В отупске",
                        "position": "Главный клиенсткий менеджер"
                      },
                      {
                        "id": 153,
                        "name": "Елена",
                        "surname": "Сафонова",
                        "flag": "На больничном",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 154,
                        "name": "Елизавета",
                        "surname": "Капустина",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 155,
                        "name": "Маргарита",
                        "surname": "Кириллова",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 156,
                        "name": "Марина",
                        "surname": "Моисеева",
                        "flag": "Свободен",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 157,
                        "name": "Валентина",
                        "surname": "Елисеева",
                        "flag": "В отупске",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 158,
                        "name": "Валерия",
                        "surname": "Кошелева",
                        "flag": "На больничном",
                        "position": "Ассистент клиентского менеджера"
                      }
                    ]
                  },
                  "Отдел продаж 2": {
                    "name": "Отдел продаж 2",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 159,
                        "name": "Варвара",
                        "surname": "Костина",
                        "flag": "Свободен",
                        "position": "Начальник отдела"
                      },
                      {
                        "id": 160,
                        "name": "Василиса",
                        "surname": "Горбачёва",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 161,
                        "name": "Акулина",
                        "surname": "Орехова",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 162,
                        "name": "Алевтина",
                        "surname": "Ефремова",
                        "flag": "В отупске",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 163,
                        "name": "Александра",
                        "surname": "Исаева",
                        "flag": "На больничном",
                        "position": "Старший клиенсткий менеджер"
                      }
                    ]
                  }
                },
                "workers": [
                  {
                    "id": 146,
                    "name": "Валерьян",
                    "surname": "Шилов",
                    "flag": "Свободен",
                    "position": "Начальник управления"
                  }
                ]
              },
              "Управление по работе с клиентами малого бизнеса": {
                "name": "Управление по работе с клиентами малого бизнеса",
                "subDepartments": {
                  "Отдел 1": {
                    "name": "Отдел 1",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 165,
                        "name": "Алла",
                        "surname": "Калашникова",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 166,
                        "name": "Анастасия",
                        "surname": "Кабанова",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 167,
                        "name": "Ангелина",
                        "surname": "Носкова",
                        "flag": "В отупске",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 168,
                        "name": "Анжела",
                        "surname": "Юдина",
                        "flag": "На больничном",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 169,
                        "name": "Оксана",
                        "surname": "Кулагина",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      }
                    ]
                  },
                  "Отдел 2": {
                    "name": "Отдел 2",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 170,
                        "name": "Октябрина",
                        "surname": "Лапина",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 171,
                        "name": "Ольга",
                        "surname": "Прохорова",
                        "flag": "Свободен",
                        "position": "Ведущий  клиенсткий менеджер"
                      },
                      {
                        "id": 172,
                        "name": "Александра",
                        "surname": "Нестерова",
                        "flag": "В отупске",
                        "position": "Старший клиенсткий менеджер"
                      },
                      {
                        "id": 173,
                        "name": "Алина",
                        "surname": "Харитонова",
                        "flag": "На больничном",
                        "position": "Старший клиенсткий менеджер"
                      }
                    ]
                  },
                  "Отдел кредитования": {
                    "name": "Отдел кредитования",
                    "subDepartments": {},
                    "workers": [
                      {
                        "id": 174,
                        "name": "Алла",
                        "surname": "Агафонова",
                        "flag": "Свободен",
                        "position": "Начальник отдела"
                      },
                      {
                        "id": 175,
                        "name": "Анжела",
                        "surname": "Муравьёва",
                        "flag": "Свободен",
                        "position": "Кредитный аналитик"
                      },
                      {
                        "id": 176,
                        "name": "Евгения",
                        "surname": "Ларионова",
                        "flag": "Свободен",
                        "position": "Кредитный аналитик"
                      },
                      {
                        "id": 177,
                        "name": "Анжела",
                        "surname": "Федосеева",
                        "flag": "В отупске",
                        "position": "Кредитный аналитик"
                      }
                    ]
                  }
                },
                "workers": [
                  {
                    "id": 164,
                    "name": "Алина",
                    "surname": "Евдокимова",
                    "flag": "Свободен",
                    "position": "Начальник управления"
                  }
                ]
              }
            },
            "workers": [
              {
                "id": 145,
                "name": "Валерий",
                "surname": "Наумов",
                "flag": "Свободен",
                "position": "Заместитель управляющего филиалом"
              }
            ]
          },
          "Розничный блок": {
            "name": "Розничный блок",
            "subDepartments": {
              "Управление ипотечного кредитования": {
                "name": "Управление ипотечного кредитования",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 179,
                    "name": "Зинаида",
                    "surname": "Пахомова",
                    "flag": "Свободен",
                    "position": "Начальник управления"
                  },
                  {
                    "id": 180,
                    "name": "Злата",
                    "surname": "Шубина",
                    "flag": "Свободен",
                    "position": "Менеджер по работе с партнерами"
                  },
                  {
                    "id": 181,
                    "name": "Евгения",
                    "surname": "Игнатова",
                    "flag": "Свободен",
                    "position": "Менеджер по работе с партнерами"
                  },
                  {
                    "id": 182,
                    "name": "Евдокия",
                    "surname": "Филатова",
                    "flag": "В отупске",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 183,
                    "name": "Екатерина",
                    "surname": "Крюкова",
                    "flag": "На больничном",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 184,
                    "name": "Елена",
                    "surname": "Рогова",
                    "flag": "Свободен",
                    "position": "Территориальный менеджер"
                  }
                ]
              },
              "Управление инвестиционных продуктов": {
                "name": "Управление инвестиционных продуктов",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 185,
                    "name": "Елизавета",
                    "surname": "Кулакова",
                    "flag": "Свободен",
                    "position": "Начальник управления"
                  },
                  {
                    "id": 186,
                    "name": "Маргарита",
                    "surname": "Терентьева",
                    "flag": "Свободен",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 187,
                    "name": "Марина",
                    "surname": "Молчанова",
                    "flag": "В отупске",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 188,
                    "name": "Валентина",
                    "surname": "Владимирова",
                    "flag": "На больничном",
                    "position": "Территориальный менеджер"
                  },
                  {
                    "id": 189,
                    "name": "Валерия",
                    "surname": "Артемьева",
                    "flag": "Свободен",
                    "position": "Тренер по продуктам"
                  },
                  {
                    "id": 190,
                    "name": "Варвара",
                    "surname": "Гурьева",
                    "flag": "Свободен",
                    "position": "Тренер по продуктам"
                  }
                ]
              },
              "Дополнительный офис 1": {
                "name": "Дополнительный офис 1",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 191,
                    "name": "Василиса",
                    "surname": "Зиновьева",
                    "flag": "Свободен",
                    "position": "Руководитель офиса"
                  },
                  {
                    "id": 192,
                    "name": "Акулина",
                    "surname": "Гришина",
                    "flag": "В отупске",
                    "position": "Менеджер по ипотеке"
                  },
                  {
                    "id": 193,
                    "name": "Алевтина",
                    "surname": "Кононова",
                    "flag": "На больничном",
                    "position": "Менеджер по продажам"
                  },
                  {
                    "id": 194,
                    "name": "Александра",
                    "surname": "Дементьева",
                    "flag": "Свободен",
                    "position": "Ведущий менеджер по продажам"
                  },
                  {
                    "id": 195,
                    "name": "Алина",
                    "surname": "Ситникова",
                    "flag": "Свободен",
                    "position": "Клиентский менеджер"
                  },
                  {
                    "id": 196,
                    "name": "Алла",
                    "surname": "Симонова",
                    "flag": "Свободен",
                    "position": "Кассир"
                  },
                  {
                    "id": 197,
                    "name": "Анастасия",
                    "surname": "Мишина",
                    "flag": "В отупске",
                    "position": "Старший кассир"
                  }
                ]
              },
              "Дополнительный офис 2": {
                "name": "Дополнительный офис 2",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 198,
                    "name": "Ангелина",
                    "surname": "Фадеева",
                    "flag": "На больничном",
                    "position": "Руководитель офиса"
                  },
                  {
                    "id": 199,
                    "name": "Анжела",
                    "surname": "Смирнова",
                    "flag": "Свободен",
                    "position": "Менеджер по продажам"
                  },
                  {
                    "id": 200,
                    "name": "Оксана",
                    "surname": "Иванова",
                    "flag": "Свободен",
                    "position": "Ведущий менеджер по продажам"
                  },
                  {
                    "id": 201,
                    "name": "Октябрина",
                    "surname": "Кузнецова",
                    "flag": "Свободен",
                    "position": "Кассир"
                  },
                  {
                    "id": 202,
                    "name": "Ольга",
                    "surname": "Соколова",
                    "flag": "В отупске",
                    "position": "Старший кассир"
                  }
                ]
              },
              "Дополнительный офис 3": {
                "name": "Дополнительный офис 3",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 203,
                    "name": "Александра",
                    "surname": "Попова",
                    "flag": "На больничном",
                    "position": "Руководитель офиса"
                  },
                  {
                    "id": 204,
                    "name": "Алина",
                    "surname": "Лебедева",
                    "flag": "Свободен",
                    "position": "Менеджер по ипотеке"
                  },
                  {
                    "id": 205,
                    "name": "Алла",
                    "surname": "Козлова",
                    "flag": "Свободен",
                    "position": "Менеджер по продажам"
                  },
                  {
                    "id": 206,
                    "name": "Анжела",
                    "surname": "Новикова",
                    "flag": "Свободен",
                    "position": "Ведущий менеджер по продажам"
                  },
                  {
                    "id": 207,
                    "name": "Евгения",
                    "surname": "Морозова",
                    "flag": "В отупске",
                    "position": "Клиентский менеджер"
                  },
                  {
                    "id": 208,
                    "name": "Анжела",
                    "surname": "Петрова",
                    "flag": "На больничном",
                    "position": "Кассир"
                  },
                  {
                    "id": 209,
                    "name": "Евгения",
                    "surname": "Волкова",
                    "flag": "Свободен",
                    "position": "Старший кассир"
                  }
                ]
              },
              "Дополнительный офис 4": {
                "name": "Дополнительный офис 4",
                "subDepartments": {},
                "workers": [
                  {
                    "id": 210,
                    "name": "Акулина",
                    "surname": "Соловьёва",
                    "flag": "Свободен",
                    "position": "Руководитель офиса"
                  },
                  {
                    "id": 211,
                    "name": "Алевтина",
                    "surname": "Васильева",
                    "flag": "Свободен",
                    "position": "Менеджер по продажам"
                  },
                  {
                    "id": 212,
                    "name": "Александра",
                    "surname": "Зайцева",
                    "flag": "В отупске",
                    "position": "Ведущий менеджер по продажам"
                  },
                  {
                    "id": 213,
                    "name": "Алексей",
                    "surname": "Павлов",
                    "flag": "На больничном",
                    "position": "Кассир"
                  },
                  {
                    "id": 214,
                    "name": "Альберт",
                    "surname": "Семёнов",
                    "flag": "Свободен",
                    "position": "Старший кассир"
                  }
                ]
              }
            },
            "workers": [
              {
                "id": 178,
                "name": "Евгения",
                "surname": "Зимина",
                "flag": "На больничном",
                "position": "Заместитель управляющего филиалом"
              }
            ]
          }
        },
        "workers": [
          {
            "id": 144,
            "name": "Валентин",
            "surname": "Жданов",
            "flag": "Свободен",
            "position": "Управляющий филиала"
          }
        ]
      }
    }
  }`)

  export default sampleData;